
'''
python 講座

Intro

機械学習、AI
ビックデータ解析
クラウド
等に多少なりとも、興味がある場合、ツールとして
身につけて置いたほうが良いものです。

とても豊富な部品がそろっているので、それらを利用すると
相当なことが出来てしまいます。

ただ、プログラムの本質は、アルゴリズムであることは忘れないでください。

また、コーディングというのは、最終的な実装となります。
基本設計、詳細設計、パラメータ設計、構築、テスト　という流れでいくと　パラメータ設計、
テストくらいに相当します。


対象者
プログラムに対して多少興味があるのであれば、誰でも

切り口

youtube()
gmail
google
facebook
twiter

ソフトウェアは面白い

一方、ハードウェアも面白い
電子工作、ブレッドボード
ゲルマニウムラジオ

物理、数学、宗教、アート










Iot
ソラコムのデバイス
エッジコンピューティング
コーラル

クラウド
サーバレス環境のプログラミング
AWS   lambda
Azure function
GCP   function




















今は、単なるお勉強だと思います。必要性がないので
selfって何　

泣きそうになるくらい、大量のデータ操作を
手作業でやるとき、必死で、効率のいい方法、関数やマクロを探すと思います

おそらく、商用の業務アプリケーションを書くことはないと思いますが
java同様、クラスが使えないと、お手上げです。
クラスを使うメリットは、そのうちわかると思います。
圧倒的なパワーがあります。
これを使わないでプログラムをつくるのは、地獄です。


ただ、皆さんは、もうすでに、クラスを使っています。
変数
整数
文字列
外部モジュール
これら、全部、クラスです
データもメソッドも普通に使っています。

なので、クラスがどういうものなのかを知ることは
pythonをより深く知るためには、必要です。
''''
